cubicBuilding/cubicBuilding.simpleFoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.357075;

boundaryField
{
    top
    {
        type            slip;
    }
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.357075;
    }
    cube
    {
        type            kqRWallFunction;
        value           uniform 0.357075;
    }
    sides
    {
		type			slip;
    }
}


// ************************************************************************* //
